#### 生成DataFrame

In [41]:
import pandas as pd
df = pd.DataFrame([[101,'frank', 'M', 29], [102,'mary', 'F', 23], [103,'tom', 'M', 35], [104,'ted', 'M', 33], [105,'jean', 'F', 21], [106,'lisa', 'F', 20]],
                  columns = ['userid','name', 'gender', 'age'])
df

   userid   name gender  age
0     101  frank      M   29
1     102   mary      F   23
2     103    tom      M   35
3     104    ted      M   33
4     105   jean      F   21
5     106   lisa      F   20

## 一、选择查看指定行列

#### 查看前5行

In [42]:
df.head()

   userid   name gender  age
0     101  frank      M   29
1     102   mary      F   23
2     103    tom      M   35
3     104    ted      M   33
4     105   jean      F   21

#### 查看前3行

In [43]:
df.head(3)

   userid   name gender  age
0     101  frank      M   29
1     102   mary      F   23
2     103    tom      M   35

#### 查看最后5行

In [44]:
df.tail()

   userid  name gender  age
1     102  mary      F   23
2     103   tom      M   35
3     104   ted      M   33
4     105  jean      F   21
5     106  lisa      F   20

#### 查看最后3行

In [45]:
df.tail(3)

   userid  name gender  age
3     104   ted      M   33
4     105  jean      F   21
5     106  lisa      F   20

### 选取特定行和列（loc和iloc）

区别：
1、loc是根据dataframe的具体标签名称选取列，而iloc是根据标签所在的位置取列，从0开始计数；
2、loc取行是闭区间，iloc取行是开区间。

举例：
一、选取标签为id和name的列，选完类型还是dataframe
df = df.loc[:, ['id', 'name']]
df = df.iloc[:, [0, 2]]
二、选取标签为id和name的列，并且只取前两行，选完类型还是dataframe
df = df.loc[0:1, ['id', 'name']]   [0,1]闭区间
df = df.iloc[0:2, [0, 2]]   [0,2)开区间
三、选取行，选完类型还是dataframe
df = df.loc[0:2,:]  选取0-2行，[0,2]闭区间
df = df.iloc[0:2,:] 选取0-1行，[0,2)开区间

#### 查看前3行，前2列（loc，基于行的索引名称、列的字段名称进行提取）

In [46]:
df.loc[0:2,['name','gender']]

    name gender
0  frank      M
1   mary      F
2    tom      M

#### 查看前3行，前2列（iloc，基于行和列所在位置进行提取）

In [47]:
df.iloc[0:3,0:2]

   userid   name
0     101  frank
1     102   mary
2     103    tom

#### 选取指定列

In [48]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [49]:
df.name

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

#### 选取特定列

In [50]:
df[['name','age']]    #注意：有两层中括号

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

#### 选取指定行

In [51]:
df.loc[[1,3,5]]

   userid  name gender  age
1     102  mary      F   23
3     104   ted      M   33
5     106  lisa      F   20

In [54]:
df.iloc[[1,3,5]]

   userid  name gender  age
1     102  mary      F   23
3     104   ted      M   33
5     106  lisa      F   20

## 二、变更索引

In [55]:
df.set_index('userid', inplace=True)
df

         name gender  age
userid
101     frank      M   29
102      mary      F   23
103       tom      M   35
104       ted      M   33
105      jean      F   21
106      lisa      F   20

### 变更索引后的loc和iloc

#### 选取指定行和列

In [56]:
df.loc[101:103,['name','age']]    # 基于行的索引名称、列的字段名称提取

         name  age
userid
101     frank   29
102      mary   23
103       tom   35

In [57]:
df.iloc[0:3,0:2]    # 基于行和列所在位置进行提取

         name gender
userid
101     frank      M
102      mary      F
103       tom      M

#### 选取指定行

In [58]:
df.loc[[101,103,105]]

         name gender  age
userid
101     frank      M   29
103       tom      M   35
105      jean      F   21

In [59]:
df.iloc[[0,2,4]]

         name gender  age
userid
101     frank      M   29
103       tom      M   35
105      jean      F   21

#### 重置索引

In [1]:
df.reset_index()    # 也可以在括号里面指定删除某个索引

NameError: name 'df' is not defined